//145. Ввести число N (N≤1000). В функции сформировать символьную строку, содержащую это число, записанное русскими буквами
//(например, сто пятьдесят шесть). Содержимое строки вывести в main.
#include <stdio.h>
#include <windows.h>

void numToText(int num);

int main()
{
    SetConsoleOutputCP(CP_UTF8);
    int N;
    printf("Введите число N: ");
    scanf("%d", &N);

    numToText(N);

    return 0;
}

void numToText(int num) {
    char *units[] = {"ноль", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    char *teens[] = {"", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"};
    char *tens[] = {"", "десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    char *hundreds[] = {"", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"};

    if (num == 0) {
        printf("ноль\n");
        return;
    }

    if (num == 1000){
        printf("тысяча");
    }

    if (num >= 100) {
        printf("%s ", hundreds[num / 100]);
        num %= 100;
    }
    
    if (num >= 20 || num == 10) {
        printf("%s ", tens[num / 10]);
        num %= 10;
    }

    if (num >= 11 && num <= 19) {
        printf("%s\n", teens[num - 10]);
    }

    if (num >= 1 && num <= 9) {
        printf("%s\n", units[num]);
    }
}
